---
kind: other
id: Properties.T:Autodesk.Revit.DB.Fabrication.FabricationPartRouteEnd
source: html/84262c43-2590-5b53-66e4-e88ff26e53f8.htm
---
# FabricationPartRouteEnd Properties

Specifies whether the .NET object represents a valid Revit entity.